run/fluidisedBed/Allrun
#!/bin/sh

# =============================================================================
# Allrun Script for the Polydisperse Fluidized Bed Tutorial
# -----------------------------------------------------------------------------
# This script runs a simulation of a fluidized bed with two distinct solid
# phases, demonstrating the polydisperse granular flow models.
#
# The workflow is as follows:
# 1. A simple mesh is created for the bed container.
# 2. A region at the bottom is initialized with particles using setFields.
# 3. The case is decomposed for parallel execution.
# 4. The simulation is run in parallel.
# 5. The results are reconstructed for visualization.
#
# Usage: ./Allrun
# =============================================================================

# Change to the script's directory for robust execution
cd "${0%/*}" || exit 1

# Source the OpenFOAM functions for running applications
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

# --- CLEANING ---

echo "--> Cleaning the case from previous runs..."
./Allclean

# --- MESHING AND SETUP ---

echo "--> Creating the mesh for the fluidized bed..."
runApplication blockMesh

echo "--> Initializing the particle bed at the bottom of the domain..."
# This uses system/setFieldsDict to set the initial volume fractions
# for both particles1 and particles2 in a specified box.
runApplication setFields

echo "--> Decomposing the domain for parallel execution..."
runApplication decomposePar


# --- SIMULATION ---

echo "--> Starting the fluidized bed simulation in parallel..."
# getApplication reads the solver name (e.g., OpenPDAC) from system/controlDict
runParallel $(getApplication)


# --- POST-PROCESSING ---

echo "--> Reconstructing the case results for visualization..."
# This merges the processor* directories into the main time directories.
runApplication reconstructPar

# -----------------------------------------------------------------------------
echo
echo "Allrun script finished successfully."
echo "Results are ready for post-processing with 'paraFoam' or ParaView."
# =============================================================================
